backward-facing-step-flow/backStep/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.002;

boundaryField
{
    inlet
    {
		type			timeVaryingMappedFixedValue;
		setAverage		off;
		offset			0; 
    }
    outlet
    {
        type            zeroGradient;
    }
    Wall
    {
        type            kqRWallFunction;
        value           uniform 0.002;
    }
    VerticalWall
    {
        type            kqRWallFunction;
        value           uniform 0.002;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
