backward-facing-step-flow/backStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;
vertices        
(
    (-2 1 1)
    (-2 1 3)
    (-2 0 3)
    (-2 0 1)
    (0 1 1)
    (0 1 3)
    (0 0 3)
    (0 0 1)
    (15 1 1)
    (15 1 3)
    (15 0 3)
    (15 0 1)
    (0 0 0)
    (0 1 0)
    (15 0 0)
    (15 1 0)    
);
blocks          
(
    hex (3 7 4 0 2 6 5 1) (5 1 10) simpleGrading (1 1 1) // inlet block
    hex (7 11 8 4 6 10 9 5) (50 1 10) simpleGrading (1 1 1) // flow over step block
    hex (12 14 15 13 7 11 8 4) (50 1 5) simpleGrading (1 1 1) // recirculation block   
);
edges           
(
);
boundary         
(
    inlet
    {
    type patch;
    faces
    (
        (0 3 2 1)
    );      
    }
    outlet
    {
    type patch;
    faces
    (
        (11 8 9 10)
        (14 15 8 11)
    );      
    }
    Wall 
    {
    type wall;
    faces
    (
        (0 4 7 3)
        (12 13 14 15)
        (2 6 5 1)
        (6 10 9 5)
    );  
    }
    VerticalWall 
    {
    type wall;
    faces
    (
        (13 12 7 4)
    );  
    }
    frontAndBack
    {
    type empty;
    faces
    (
        (3 7 6 2)
        (12 14 11 7)
        (7 11 10 6)
        (0 1 5 4)
        (4 5 9 8)
        (13 4 8 15)
    );
    }
);
mergePatchPairs
(
);
// ************************************************************************* //
