backward-facing-step-flow/backStep/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;// To be completed

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         400; // To be completed

deltaT          0.1; // To be completed

writeControl    runTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{

	#includeFunc residuals

	fieldAverage1
	{
		type			fieldAverage;
		libs			("libfieldFunctionObjects.so");
		fields
		(
			U
			{
			mean on;
			prime2Mean on;
			base time;
			}

			k
			{
			mean on;
			prime2Mean on;
			base time;
			}
		);
	}
		

	//#includeFunc probes
	//#includeFunc writeObjects
}


// ************************************************************************* //
